## Plan Result (883: prod_landing - TerraformPlanApply)




<pre><code>Plan: 4 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_access_policy.runtimes_datafactory[&#34;meta001&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_access_policy.runtimes_datafactory[&#34;meta002&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_access_policy.shared_integration_datafactory[&#34;meta001&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_access_policy.shared_integration_datafactory[&#34;meta002&#34;]
* Update
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;main&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_landing_zone["00"].azurerm_key_vault_access_policy.runtimes_datafactory["meta001"] will be created
  + resource "azurerm_key_vault_access_policy" "runtimes_datafactory" {
      + id                 = (known after apply)
      + key_vault_id       = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.KeyVault/vaults/ingest00-meta001-prod"
      + object_id          = "4bf62933-e968-47c7-b707-fde4567a2ca2"
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.data_landing_zone["00"].azurerm_key_vault_access_policy.runtimes_datafactory["meta002"] will be created
  + resource "azurerm_key_vault_access_policy" "runtimes_datafactory" {
      + id                 = (known after apply)
      + key_vault_id       = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.KeyVault/vaults/ingest00-meta002-prod"
      + object_id          = "4bf62933-e968-47c7-b707-fde4567a2ca2"
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.data_landing_zone["00"].azurerm_key_vault_access_policy.shared_integration_datafactory["meta001"] will be created
  + resource "azurerm_key_vault_access_policy" "shared_integration_datafactory" {
      + id                 = (known after apply)
      + key_vault_id       = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.KeyVault/vaults/ingest00-meta001-prod"
      + object_id          = "5db1b6eb-6169-4d2f-84fb-fa18081d0a5c"
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.data_landing_zone["00"].azurerm_key_vault_access_policy.shared_integration_datafactory["meta002"] will be created
  + resource "azurerm_key_vault_access_policy" "shared_integration_datafactory" {
      + id                 = (known after apply)
      + key_vault_id       = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.KeyVault/vaults/ingest00-meta002-prod"
      + object_id          = "5db1b6eb-6169-4d2f-84fb-fa18081d0a5c"
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.data_landing_zone["00"].azurerm_resource_group.this["main"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id         = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod"
        name       = "ingest00-main-prod"
      ~ tags       = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
          - "expiresAfter"        = "3000-01-01" -> null
            "startupMode"         = "always"
        }
        # (2 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.data.azuread_group.admin_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "admin_group" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS DLRM Data Ingestion Admin (env:production)"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.azurerm_mssql_database.this["MetadataControl"] will be updated in-place
  ~ resource "azurerm_mssql_database" "this" {
      ~ auto_pause_delay_in_minutes                                = 0 -> -1
        id                                                         = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Sql/servers/ingest00-metadata-mssql-prod/databases/MetadataControl"
        name                                                       = "MetadataControl"
        tags                                                       = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.azurerm_mssql_server.this will be updated in-place
  ~ resource "azurerm_mssql_server" "this" {
        id                                           = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Sql/servers/ingest00-metadata-mssql-prod"
        name                                         = "ingest00-metadata-mssql-prod"
        tags                                         = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (16 unchanged attributes hidden)

      ~ azuread_administrator {
          ~ object_id                   = "efb2b089-d742-414b-9956-142bf6effb43" -> (known after apply)
          ~ tenant_id                   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.metadata_mysql.data.azuread_group.admin_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "admin_group" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Platform Operations SC"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.data_landing_zone["00"].module.metadata_mysql.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["00"].module.metadata_mysql.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_databricks.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_databricks.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory.this will be updated in-place
  ~ resource "azurerm_data_factory" "this" {
        id                               = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-prod"
        name                             = "ingest00-integration-dataFactory001-prod"
      + purview_id                       = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest-mgmt-rg-stg/providers/Microsoft.Purview/accounts/ingest-mgmt-purview-stg"
      ~ tags                             = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "High"
          + "environment"         = "production"
          + "startupMode"         = "always"
        }
        # (6 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["curated"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["external"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["landing"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["raw"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["sftp"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

Plan: 4 to add, 4 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label 883: prod_landing - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/dlrm-data-ingest-infra/issues/110/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":110,"Program":"tfcmt","SHA1":"","Target":"883: prod_landing - TerraformPlanApply","Vars":{}} -->